{
  "title": "我眼中的蛙鸣",
  "author": "丁西汝",
  "contents": [
    {
      "type": 0,
      "content": "/dist/image/eyes/eyes-image1.png",
      "class": ""
    },    
    {
      "type": 1,
      "content": "从入职的二月底到现在，时间上自我认为我还是一名蛙鸣新人，一名职场人我个人觉得只有不断保持着新人的心态才能学习到更多，而整个公司也会不断的保持着旺盛的青春力。来到蛙鸣首先让我觉得是一种幸运。如果把我眼中的蛙鸣表达出来，我可能会选择用时间的方式去表达我眼中的蛙鸣。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "遛狗的，跑步的，人来人往的北京城就这样开始了全新的一天。早上8点开始从家里出发，步行至地铁站，就开始加入了上班早高峰的队伍中。5号线到14号线这是我的日常路线。每天早晚不同的线程上都可能有蛙鸣人的步伐。比起其他公司蛙鸣的上班时间没有那么紧张，我们不会因为早上时间紧而冲冲忙忙饥肠辘辘。俗话说得好吗一天之计在于晨吃饱才能好干活！",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "10点多的蛙鸣已经开始忙碌起来，咔咔交错的键盘声每个人都在进行着自己一天中需要负责的任务。蛙鸣的管理制度在我所经历的公司中是比较完善的，合理的任务分配任务管理才能高效率高质量的完成。蛙鸣是对细节要求比较高的，一个好的发展和细节务必是挂钩的。如果把蛙鸣的发展比喻成什么，我 觉得应该是“火箭”。大至发动小至螺丝钉每一个部分都有其发挥的作用。不要因为一颗螺丝钉而去忽略。只有严格的细节把关我们的“火箭”才能飞的更稳飞的更高！",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "12点多茶水间微波炉叮的一声也在提醒着大家蛙鸣的上午就结束了。午餐时间必然是最开心的，茶水柜子里的饮品，喜欢的剧，一顿轻松自在的午餐。吃完饭你或许可以选择小憩一会，也可以选择去楼下悠然自得晒着太阳散着步。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": " 1点多每个部门又开始忙碌起来。下午的时间在工作中流逝的很快，当你感觉到肚子饿的时候一抬头可能就四五点了。蛙鸣的小柜子里总会有你心仪的零食等着你。接近下班了大家也都会每个部门开始自己的站立会，简洁的总结一下当天的任务完成和工作交流。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "每一周的周四公司都会去附近的羽毛球馆预约场地，劳逸结合的安排让大家在工作之余也能得到放松。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "每个月我们都会有员工的生日会，这是蛙鸣人最幸福的时刻，也许你只身在外离开家乡忙忙碌碌，但是蛙鸣会为你记住这个时刻。吹蜡烛吃蛋糕玩游戏，大家除了工作感情上也会更加的紧密。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "每一年年中年终蛙鸣都会给员工进行调薪，六月底的集体外出团建也是大家很幸福的时刻，一起工作一起玩一起疯一起成长，年底的年会有各种大奖，就算是阳光普照奖也是一款很不错的礼品。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "走过春夏秋冬你见证了蛙鸣的成长蛙鸣也见证着你的成长，工作中生活中你总会在每一个任务每一个普通的一天辛勤的付出中得到收获。晚上走往14号线回头望一望灯光闪烁的soho楼内心的满足感油然而生，回到家洗漱完躺在床上望着窗外，繁忙的北京也渐渐安静下来。在人口密集的大城市自己有小小的立足之地，也是蛙鸣的给予。伴着梦想进入梦乡休息好了迎接蛙鸣人崭新一天！",
      "class": ""
    }
  ]
}