{
  "title": "Frog  Design",
  "author": "李超群",
  "contents": [ 
    {
      "type": 1,
      "content": "来蛙鸣的第四个月，开始的第二个项目，便是蛙鸣前端组件库—Frog-design的构建。",
      "class": "topStyle"
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "刚得知要启动这个项目时，我只觉得这个想法太crazy了。组件库是什么，它是能大幅提高前端工程师的开发效率及质量，能让项目的研发事半功倍的利器。但网上有大量精美且功能完善的组件库摆在那，有花费人力物力大量时间去投入的必要吗。再看看像ant-design、Element-UI这样知名的组件库，只觉得任重而道远。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "在起初和UED同事开会讨论组件库构成及规范时，大家都是摸着石头过河，讨论的时候尽可能多的提出各自的意见，但最后成果是什么样，大家心里也都没谱。计划敲定，没过多久，便拿到了UI设计原型图，十几个组件整整齐齐的摆在那儿，一排亮眼的颜色表，真的很漂亮，UED的同事率先出色的完成了她们该做的工作。麻雀虽小五脏俱全，项目里常用的组件、各类功能都分门别类整装待发，好像在召唤我们去完成它。我不知道其他同行有没有我这种体会，从原型图的解剖到一行行代码的推敲、直到网页上的成品，与其说是完成任务，我觉得更是设计、亦或是创造。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "一个优秀的工具，会使用是第一，但当你能创造，才是掌握了精髓。这大概是我完成第一个组件之后最深刻的感悟。我分到的第一个组件是toast，说实话，真的是一头雾水。我尝试去翻阅那些成功的组件库的构思，他们的想法及实现方式。一个组件，从无到有，从逻辑到功能到样式，我甚至理不清要先完成哪个部分。第一次前端组件库发开小组的讨论会，是在我稀里糊涂毫无进展时开始的，主要是沟通一下各自第一个组件的进度。前面几个同事总结思路时，好像一下把我脑海里千丝万缕错综复杂的思路捋顺了。第一步样式的展示，再到逻辑的梳理，功能的完善，代码的规范，清晰的开发思路一下便井井有序的摆出来了。开始敲代码啦，公共样式的抽取整合让单个组件不再像一个孤独的战士，它们在主题颜色的配置中血脉相连。当这个灰色的小方块第一次成功弹出来，我才觉得自己也融入到组件库中，才从工具的使用者变成工具的创造者，也才真正开始贡献出自己的力量。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "让我印象最深刻的组件是textarea多行文本框，它不似toast那样功能的单一，也异于radio，checkbox样式的固定。它外放的api更多，可抽离的更复杂。必选项，label，统计字数，警示文字，警示边框，等等一系列，但我也更加成熟，组件库开发到最后也逐渐形成了自己的开发流程，分析时统计成表格，尝试时多整理问题。我也一点点重新去懂得这个组件库的意义，它不只是单纯的做出这样一个个的组件，它更多的让我们在创造中找到自身的缺点去攻克它。每次组件库开始时大家的沟通交流也使我们更加团结。组件库是一个团体，站在组件库后面的我们则更是一个team。这次组件库的完成，除了大家看到的成品还有我们在任务中接触到的sass语法，webpack配置，es-lint规范，热加载配置等等新的学习工作，在创造中，我们完善了自己的知识库，学会了梳理自己的思路，这又何尝不是进步收获呢。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "在组件库即将结尾时，我在网上看了马云在杭州召开的云栖大会。这位成功的企业家在会上说， Research for problem，not for profit。那一刻我觉得Frog-design就在完成这样一件事，not for money，for fun，for creation，for solving the problem。以及老大和我说的那句话，“Frog-design是我来到蛙鸣的第一个孩子”，是的，这短短的一个月，我一步一步的伴着它成长，也一遍一遍重新的领会着它带给我的一切。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "Frog-design到目前为止只是第一版刚刚完结。我还在使用组件库来添加到相框后台的项目中，我们仍在使用它时发现它的欠缺，去努力修正它，完善它。主题颜色的统一让我想到能不能根据当前温度来让主题自动更换，今天冷一些就让颜色暖一点，来让我们的Frog-design更加人性化，智能化。 Frog-design就像一个巨大的宝藏，还有很多值得我们挖掘的地方，我们从中获取，从中学习，从中提升自我，同时完善它，让它有更少的bug，更好看的主题，更优秀的功能，更人性化的交互。今天的我只希望明天的Frog-design能走的更远。",
      "class": ""
    }
  ]
}