{
  "title": "母亲",
  "author": "王亚楠",
  "contents": [
    {
      "type": 0,
      "content": "/dist/image/mother/mother-image1.png",
      "class": ""
    }, 
    {
      "type": 0,
      "content": "/dist/image/mother/mother-image2.png",
      "class": "imageMargin imageNoMarginBottom"
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "母亲在我心里一直是勤劳、不怕吃苦的形象。很多时候，再苦再难的工作，母亲总会找到相应的解决办法，母亲也总会在关键的时候给到整个家庭一些关键性的建议，但是这次，母亲却病倒了。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "母亲这次终于腾出时间来北京解决自己的身体问题，后背的疼痛已经持续一个月了，各种方法都已经尝试，仍然没有什么好的起色，疼起来的时候，彻夜难眠。在北京的这段时间，她也总是自己去各大医院奔走，总害怕因为自己耽误了我的工作，影响了我的生活。一日晚上，母亲在床上疼痛得已经无法忍受，我下班回到家后，紧急的拨打了120，等待着救护车的到来。坐上了“专属”救护车，一路忐忑，看着母亲疼痛的样子，总想为她分担几分。急急忙忙到了医院，挂了急诊，弄好了一切手续，经过了一系列的化验、检查，才最终确定：胃穿孔－必须要马上手术了。留给我们的并没有太多的时间选择，看着母亲疼痛的样子，我们马上同意了手术。第一次，我在各种手术单上以儿子的名义签字，这一刻心中的责任感异常的强烈。还记得母亲进入手术室前的那一刻，身上的疼痛感和心里的紧张感交错着，她用力的握了握我的手，想告诉我她的不安。而我，一方面压抑着自己内心的紧张告诉她没事，出来就会好了；另一方面，手心的汗却控制不住的冒了出来。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "两个多小时的手术终于结束，手术相当成功，但是也能看到母亲已经累到不行，急急忙忙的把母亲送到了病房，看着她虚弱的样子，我也不由自主的对我之前的生活进行反思。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "首先是我们身上的责任感。我们这个年龄，有时候总觉得自己还是个孩子，心里还总是有些对父母的依靠。虽然在工作上早已经摆脱了这种情绪，但是生活中还总是抱着一颗幼稚的心，家里不管有了什么事情，总觉得父母都能把它们解决掉，而自己呢，能照顾好自己就行。但这一次让我看到了，他们在我们长大的同时，也在渐渐的老去，我们的关系在不知不觉中发生着改变，从我们依赖他们，到相互依赖，到他们完全的依赖于我们。而我们，不得不逐渐的成熟，成熟到足以撑起整个家。我们能做的，就是要更快的改变自己的角色，让整个关系流畅的改变、完整的延续。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "其次是身体。身体是革命的本钱、健康是一切的根本。身体就是一台机器，正常运作时无声无息，以至于你察觉不到他的重要性。而一旦它向你发出警告，你不理不睬，那最后的结果往往是血淋淋的教训，每一个从手术台上下来的病人才开始了解身体的重要性。所以，从不幸中得到教训，可能是这不幸中的万幸。我们作为年轻人，耳边总能听到老辈们告诉你：平实要多注意身体、外面的饭菜要少吃、留点时间在家自己做点好吃的。这些“耳旁风”总是从我们左耳进右耳出，被我们以各种理由搪塞掉了。但仔细想想，难道我们真的还有那么“年轻”么？我想我们现在已经没法随便熬几个通宵了吧，我想我们现在已经没法随随便便的完成一个三千米了吧，我想我们现在已经没法轻轻松松的爬一次山了吧。这还是年轻的我们么？年轻是我们的资本，我想这个年轻更多的指的是我们的思想，我们敢于创新，敢于迎接挑战，敢于尝试，敢于犯错，但是身体的资本不是让我们来挥霍的。我们要学会“理财”，让他们升值，让他们能更好、更长远地服务于我们的精神，这样，我们才会得到更多的财富。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "祸兮福所倚，福兮祸所伏。我们年轻人就要有年轻人的样子，充分利用我们的资本，去创造我们的未来。",
      "class": ""
    }
  ]
}