{
  "title": "带感的节奏",
  "author": "周振林",
  "contents": [
    {
      "type": 0,
      "content": "/dist/image/rhythm/rhythm-image1.png",
      "class": ""
    },    
    {
      "type": 1,
      "content": "我们是一群来自五湖四海的创业者，富有激情，充满力量，在日复一日的工作中，努力前行，不忘初心。今天的我们基本做到整齐、协调、快速、高效，这是保障我们创业成功的基础，这样的团队，具有强大的战斗力。这得益于我们团队中每一个小伙伴的努力，同时辅以“一种意识，三个准则”，锻造我们这支队伍。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "戒急用快的意识",
      "class": "subtitleStyle"
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "天下武功，唯快不破。这里强调的就是快，为了分清楚“快”和“急”，我们在团队内部达成如下共识:",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "1. 急，是一种情绪，是由于对某个目标的渴望，所产生的一种  心理活动。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "2. 快，是一种行为方式。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "“急”和“快”从内涵或外延上都不具有关联性，但在现实中，若不加以清晰的区分，往往会误导我们，甚至会把“急”当作是“快”。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "我们戒除“急”，是要戒除急躁的心理，戒除急躁的工作方式，因为急躁的情绪不加以戒除，甚至在团队内部蔓延开来的话，会让我们浮躁，浅尝辄止。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "我们倡导“快”，是要提倡快速的行为方式，因为快速的行为方式是团队快速前行的基础。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "在团队内部的管理系统上，通知邮件的第一句话就是“第一时间完成属于自己应该做的工作，就是最大的负责和认真。”因为我们是一个需要相互配合的团队，每一个团队成员都能快速的完成自己当下的工作，就是对其他人工作的支持，所有人都能够快速完成属于自己的工作，整个团队就能快速的前进。",
      "class": ""
    },
    {
      "type": 0,
      "content": "/dist/image/rhythm/rhythm-image2.png",
      "class": ""
    },
    {
      "type": 1,
      "content": "稳中求胜准则",
      "class": "subtitleStyle"
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "为了确保我们每一项工作目标的实现，在倡导“快”的同时，我们辅以“稳”，以确保我们团队的快是有序的、高效的。在“快”这种行为方式中，我们辅以有效的、科学的实施方法，“快”就能够在不影响其速度的同时，达成“稳”的状态。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "1. 科学拆分每一项工作。当一项工作来的时候，我们首先分析好这项工作，包括目标和要求等，然后对这项工作进行拆分，拆分的方法主要采用scrum。无论是技术还是非技术的目标，使用这种理念，科学有效的把一项工作从人力资源的维度上拆分到每一个人、每一个小组，从时间资源的维度上，拆分到每一个星期、每一天。这样就能根据工作要求的轻重缓急，调配相应的人力资源或者是时间资源，以确保工作的准时完成。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "2. 认真检查每一个节点。经过拆分后的工作，形成了一个个的节点，从人力资源的维度上，这些节点有相应的负责人，从时间维度上，这些节点对应的具体的时间，我们称之为一个冲刺（sprint）。在具体执行过程中，对每一个节点进行认真的检查，以确保每一个节点都能够按照要求，准时、保质的完成。一旦发现任何一个节点有延误的可能，立即重新组织、调配资源，以确保该节点的完成，并对该节点的拆分科学性、人力资源可靠性、时间资源合理性这三个维度进行管理上的总结，为下一次工作积累经验。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "3. 仔细核对每一个任务。到了每一个项目参与者身上，就是一个个任务，这些任务的颗粒度，在时间维度上，不超过4个小时，以确保每半天做一次检查（review），最细颗粒度，可以达半个小时。同时，这些任务以时间顺序的维度，每天开始工作之前，填写到todo上，每天收工之前，对当天的todo进行回顾和确认。在管理的维度上，每天开工前团队举行站立会，集中讲述每一个人当天的任务，并进行讨论。每天收工前团队也要举行站立会，集中回顾每一个人当天的任务完成情况，并进行总结。这些站立会秉承21分钟高效会议原则，站立形式举行，确保在21分钟内完成。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "4. 充分做好每一次准备。正所谓“磨刀不误砍柴工”，我们坚定的认为，只有做好每一项工作前的准备——包括产品评审、设计评审、技术评审、推文评审、销售评审、客户评审、合同评审、采购（PO）评审、生产评审、质量评审、价格评审、财务评审等等，才能够理解并按要求完成这项工作，只有每一天做好工作前的准备工作——个人todo撰写、晨立会、晚立会等等，才能确保每个人每一天清晰的工作目标，获得每一天充实的收获。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "通过这些科学有效的方法，确保了团队在快速推进的同时，做到了稳中求胜。甚至是对整体战略、局部战略、具体战术等各个层面，都采取此种方法，贯彻此种理念，逐步形成了从不轻言放弃的精神，不会在战略、战术上轻言改变，轻易调整。每一次战略和战术的制定，都不草率，每一次调整都不随意。团队在稳稳的、高效的快速前进，听见的只有轻微的疾行脚步声，看到的只有方向一致坚定的目光。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "管理即服务准则",
      "class": "subtitleStyle"
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "团队中的每一个人都在管理岗位上，有的管理很多人、很多事物，有的管理好自己。无论在哪一个岗位上，准则是一样的：管理即服务。管理很多人的，要为很多人服务，管理自己的，要为自己做好服务。服务的内容大体是一致的，包括准备、检查、总结、提高。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "准备，包括资料准备、资源准备等。一项工作或一个任务的高效、保质完成，有赖于准备工作，可以说没有坚实的准备工作，就不会有工作或任务的完成，准备工作的充分度与工作或任务的完成度，呈正相关关系。基于此，管理很多人的时候，要为所管理的人员做好这些准备工作，还要指导所管理的人员做好其个人的准备工作，这就要以服务的准则来做，任何人都不能做甩手掌柜。对于个人而言，在执行每个任务的时候，在每一天开始的时候，也要做好自己的准备工作，想一想今天要做什么，分一分今天的工作时间，做一做今天的规划，写一写今天的todo清单，这就是给自己做的服务。没有这些准备，就没有团队或个人的战斗力，这是兵马未动前的先行的粮草，是战斗胜利的保障。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "检查，包括任务内容检查，时间节点检查，工作质量检查等。一项工作，涉及的环节或节点越多，每一个节点的检查工作就越重要，因为环节和节点的完成度是累积的，只有确保每个环节和节点的完成度，才能够确保最终工作目标的完成度。管理很多人，就需要对这些人的工作内容和节点进行检查，管理自己，就需要对自己每一个任务进行检查、每半天进行检查。这项要求，辅助以系统自动生成的日报、周报、月报等，发送给任何有需要的人，确保能够对每一项工作、每一个任务、每一个节点进行有效的检查工作。检查的目的是为了确保每个任务、每个环节、每个节点、每项工作按要求完成，及时发现问题，及时调配资源，同时，检查的另一个目的是为了总结。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "总结，包括经验、教训两个方面，无论是团队协同的工作，还是个人的工作，在任务完成后，都做总结。对团队的总结，从协调配合到执行方案，全面的总结，目的是为了在下一个任务执行的时候，借鉴之前成功的经验，避免之前走过的弯路。对个人而言，总结意味着不断的反思，正所谓见贤思齐，每日三省吾乎己，则智明行无过矣，这对小伙伴个人是能力的提高方法，更是自身素质的培养途径。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "在这样的理念指导下，每一个人、每一个团队，做好管理，就是服务好自身、服务好团队，让自己快速成长，让团队快速进步。配合职级职等制度的实施，将每个人的发展和提高，与之职位、职级自动关联，同时与薪资相关联，小伙伴们通过系统的、可量化的角度，看到自身的成长。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "关注流程准则",
      "class": "subtitleStyle"
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "流程是协同的保障，也是任务执行的保障，科学合理的流程，能够让人与人之间、团队与团队之间形成强大的合力，做到一加一大于二。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "在团队间合作的任务上，关注流程，是对任务实施有效的负责，团队核心管理者逐渐都能做到：任务到来的十五分钟内（下一步我们的目标是五分钟），完成任务的分解和部署，具体执行任务中某项工作的小伙伴，在十五分钟内完成工作计划并予以反馈，同时，管理系统上，自动会将这些信息用邮件的形式第一时间反馈给团队负责人、协同者、任务需求方等。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "在个人执行的任务上，关注流程，是对系统发送过来的任务及时处理和反馈，对已经完成的工作及时提交工作产出物并变更任务状态。对于个人的工作规划，每天的todo也以此流程予以规范，不断的循环往复，保持流程的畅通。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "基于此，关注流程，意味着关注了资源协同、任务分解、节点产出、时间控制等，在这个准则下，一个任务到来后，可以快速的分解、指派、反馈，这样，在理念上、具体实施方法上、执行和实施能力上，有效的保障了任务快速的完成。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "通过“一种意识、三个准则”的全面推广和实施，让小伙伴们掌握了“快”的方法和能力，消除了“急”的情绪，避免了“乱”的行事风格，让团队稳步快速前行。在管理上实现了四化——系统化、规范化、标准化、制度化，在具体工作中实现了三化——规划、计划、量化。同时还配合实施了月考核制度，推广OKR，实施PDCA，分析问题使用SWOT方法，制定计划关注5W1H，所有工作入系统，所有外部合作进project，诸如此类的工具和方法，成为了小伙伴们常规的思维方式。于是在表现上，我们的团队会议控制在21分钟，会议结束后5分钟内发出会议纪要，每项工作都可追踪，每个结果都可预期。",
      "class": ""
    },
    {
      "type": 2,
      "content": "",
      "class": ""
    },
    {
      "type": 1,
      "content": "这样带感的节奏，让我们快速前进，更让我们快速成长，我们轻松的扛起压力，我们愉快的解决问题......我们同时更深深的知道，为了我们自己，还有更多的技能需要get，比如英语，比如演讲，甚至还有辩论。还有更美好的风景在向我们召唤，只要我们用这样的节奏一路前行，一路高歌，一定能够给我们自己绘好人生的蓝图。",
      "class": ""
    }
  ]
}